Project/Toir/src/Catalogs/торо_КатегорииРиска/торо_КатегорииРиска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_КатегорииРиска</name>
  <attributes>
    <name>КатегорияВероятности</name>
    <type>
      <types>CatalogRef.торо_КатегорииВероятности</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияТяжестиПоследствий</name>
    <type>
      <types>CatalogRef.торо_КатегорииТяжестиПоследствий</types>
    </type>
  </attributes>
  <attributes>
    <name>КритичностьДефекта</name>
    <type>
      <types>CatalogRef.торо_КритичностьДефекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала_КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания_КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлановаяКрайняя_КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала_Период</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания_Период</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлановаяКрайняя_Период</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СтроковоеПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/торо_КатегорииРиска/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбъектКопирования = Неопределено;
		Если Параметры.Свойство("ЗначениеКопирования", ОбъектКопирования) Тогда
			Цвет = ОбъектКопирования.Цвет.Получить();
		КонецЕсли; 
	КонецЕсли; 
	
	Элементы.Цвет.Доступность = Доступность И (ПравоДоступа("Изменение", Метаданные.Справочники.торо_КатегорииРиска)
											ИЛИ ПравоДоступа("Добавление", Метаданные.Справочники.торо_КатегорииРиска));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроставитьАвтоотметкиНезаполненного();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЦветИзХранилища = ТекущийОбъект.Цвет.Получить();
	Если Не ЦветИзХранилища = Неопределено Тогда
		Цвет = ЦветИзХранилища;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Цвет = Новый ХранилищеЗначения(Цвет);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачала_КоличествоПериодовПриИзменении(Элемент)
	ПроставитьАвтоотметкиНезаполненного();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончания_КоличествоПериодовПриИзменении(Элемент)
	ПроставитьАвтоотметкиНезаполненного();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПлановаяКрайняя_КоличествоПериодовПриИзменении(Элемент)
	ПроставитьАвтоотметкиНезаполненного();
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура ПроставитьАвтоотметкиНезаполненного()
	
	Элементы.ДатаНачала_Период.АвтоОтметкаНезаполненного          = ЗначениеЗаполнено(Объект.ДатаНачала_КоличествоПериодов); 
	Элементы.ДатаОкончания_Период.АвтоОтметкаНезаполненного       = ЗначениеЗаполнено(Объект.ДатаОкончания_КоличествоПериодов); 
	Элементы.ДатаПлановаяКрайняя_Период.АвтоОтметкаНезаполненного = ЗначениеЗаполнено(Объект.ДатаПлановаяКрайняя_КоличествоПериодов); 
	
КонецПроцедуры

#КонецОбласти
